# 1. Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате и
# проверить тип и содержание соответствующих переменных. Затем с помощью онлайн-конвертера
# преобразовать строковые представление в формат Unicode и также проверить тип и содержимое переменных.

str_1 = 'разработка'
str_2 = 'сокет'
str_3 = 'декоратор'

str_list = [str_1, str_2, str_3]

for el in str_list:
    print(f'Содержание: {el}')
    print(f'Тип: {type(el)}')
    print('-------')

print()

var_unic_1 = '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430'
var_unic_2 = '\u0441\u043e\u043a\u0435\u0442'
var_unic_3 = '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'

unic_list = [var_unic_1, var_unic_2, var_unic_3]

for el in unic_list:
    print(f'Содержание: {el}')
    print(f'Тип: {type(el)}')
    print('-------')
